Tekla Open API Reference for Tekla Structures 2025
PlacingQuarterAttributes.BottomRight Property
 Defines whether the object can search for a suitable location in the bottom right direction.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool BottomRight { get; set; }
Public Property BottomRight As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PlacingQuarterAttributes Class
Tekla.Structures.Drawing Namespace